In [1]:
import pandas as pd

In [213]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2010_1102/01240.htm')

In [214]:
df = df[2]

In [215]:
df.shape

(9, 6)

In [216]:
df.head(5)

          0     1                   2               3   4   5
0       NaN   NaN  Currie (D)  19,063  Totals  19,063 NaN NaN
1       NaN   NaN              100.0%          100.0% NaN NaN
2    County   PPR                 NaN             NaN NaN NaN
3     BACON  100%                1611            1611 NaN NaN
4  BRANTLEY  100%                2134            2134 NaN NaN

In [217]:
df = df[3:]

In [218]:
df.head(5)

          0     1     2     3   4   5
3     BACON  100%  1611  1611 NaN NaN
4  BRANTLEY  100%  2134  2134 NaN NaN
5  CHARLTON  100%  1402  1402 NaN NaN
6    COFFEE  100%  5371  5371 NaN NaN
7    PIERCE  100%  3006  3006 NaN NaN

In [219]:
df = df[df.columns[[0,2]]]

In [220]:
df.head(5)

          0     2
3     BACON  1611
4  BRANTLEY  2134
5  CHARLTON  1402
6    COFFEE  5371
7    PIERCE  3006

In [221]:
df.columns = ['county', 'Richard Currie']

In [222]:
df.tail(5)

     county Richard Currie
4  BRANTLEY           2134
5  CHARLTON           1402
6    COFFEE           5371
7    PIERCE           3006
8      WARE           5539

In [223]:
df = df.melt(id_vars=['county'])

In [224]:
df.columns = ['county', 'candidate', 'votes']

In [225]:
df.head()

     county       candidate votes
0     BACON  Richard Currie  1611
1  BRANTLEY  Richard Currie  2134
2  CHARLTON  Richard Currie  1402
3    COFFEE  Richard Currie  5371
4    PIERCE  Richard Currie  3006

In [226]:
df['votes'] = df['votes'].astype(int)

In [227]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
county       6 non-null object
candidate    6 non-null object
votes        6 non-null int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [228]:
df['office'] = 'District Attorney'

In [229]:
df['district'] = 'Waycross Circuit'

In [230]:
df['party'] = 'Democrat'
# df['party'] = 'Republican'
# df.loc[df['candidate'] == 'Greg Winters', 'party'] = 'Republican'

In [231]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate       party
Richard Currie  Democrat    19063
Name: votes, dtype: int64

In [232]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,BACON,District Attorney,Waycross Circuit,Democrat,Richard Currie,1611
1,BRANTLEY,District Attorney,Waycross Circuit,Democrat,Richard Currie,2134
2,CHARLTON,District Attorney,Waycross Circuit,Democrat,Richard Currie,1402
3,COFFEE,District Attorney,Waycross Circuit,Democrat,Richard Currie,5371
4,PIERCE,District Attorney,Waycross Circuit,Democrat,Richard Currie,3006

In [233]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')